@echo off
:Start
mode con: cols=64 lines=22
color 6F
start Music1.vbs
title 《楚汉传奇》 批处理同名游戏 1.0beta
echo  ━━━━━━━━━━━━┓          ┏━━━━━━━━━━━━
echo                          ┃          ┃
echo                          ┃楚汉·传奇┃
echo                          ┃          ┃
echo                          ┗━━━━━┛
echo          \    ┃                          ------ ------
echo         ----  ┃                            ┃     /
echo          \/ ┃┃              V  S        ------ ------ 
echo          /\   ┃                            ┃  ┃ ┃ ┃
echo         /  \  ┃                          ------┃ ┃ ┃
echo                                                    /\
echo                                                   /  \
echo  输赢，不在于强弱，我是刘邦。              
echo                                     不求千次胜利，只求刘脑一颗
echo  ==============================================================
echo                       游戏方式(键盘选择)
echo.
echo                    [1]全新开始  [2]继续游戏
echo                    [3]关于游戏  [4]退出游戏
echo.
echo  ==============================================================
choice /c 1234 /n 
if %errorlevel%==1 goto newgame
if %errorlevel%==2 goto jxgame
if %errorlevel%==4 TASKKILL /F /IM WMPLAYER.EXE && TASKKILL /F /IM WSCRIPT.EXE && exit
if %errorlevel%==3 goto about

:savegame
cls
echo.
echo   本次游戏保存成功！
echo.
echo %gk%>Data\Save.txt
echo %jq%>Data\jq.txt
echo %lc%>Data\lc.txt
echo %rm%>Data\rm.txt
echo %mx%>Data\mx.txt
echo %rc%>Data\rc.txt
echo   按任意键返回当前章节
pause>nul
goto jxgame


:jxgame
set /p gks=<Data\Save.txt
if %gks%==0 goto newgame
set /p jq=<Data\jq.txt
set /p lc=<Data\lc.txt
set /p rm=<Data\rm.txt
set /p mx=<Data\mx.txt
set /p rc=<Data\rc.txt
goto %gks%

:Gameover
cls
ping -n 2 127.1>nul
echo  ==============================================================
echo                  很遗憾，刘邦在战斗中失败了……
echo  ==============================================================
echo                    于是，时光就会倒流了……
echo  ==============================================================
echo                  也许你现在就可以重新开始……
echo  ==============================================================
echo                 重新开始这伟大的楚汉之争！！！！
echo  ==============================================================
echo                      按任意键回到主菜单
pause>nul
goto Start

:about
cls
ping -n 1 127.1>nul
echo  ==============================================================
echo      《楚汉传奇·批处理游戏版》 改编自电视连续剧《楚汉传奇》
echo  ==============================================================
echo                制作工具：Notepad 游戏格式：BAT
echo  ==============================================================
echo          外接程序：Choice.exe 帮助支持：Bat百度贴吧
echo  ==============================================================
echo        代码开源，仅供学习与交流使用！禁止用于商业用途！
echo  ==============================================================
echo                        按任意键回到主菜单
pause>nul
goto Start

:newgame
cls
echo  ==============================================================
echo   9月，秦始皇向各地派出秦使，这些秦使在各地为非作歹，欺男霸女
echo  ==============================================================
echo （ 说明 及 对话 均按任意键继续 ）
pause>nul
cls
echo  ==============================================================
echo   其中一个叫司马傻的秦使来到了丰邑·中阳里村，也就是刘邦的故乡
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   此人妄图霸占刘邦之妻曹氏，却被刘邦擒于手中，无处可逃
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   但是，刘邦得知了这个人是秦始皇派出的特使，也惧怕于秦律
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   要怎么做才能让秦使不走漏风声呢……
echo  ==============================================================
pause>nul
goto setting

:Setting
set /a jq = 100
set /a lc = 150
set /a rm = 0
set /a mx = 0
goto S1

:S1
set gk=S1
cls
echo  ==============================================================
echo                      第一章 智斗秦使(选择)
echo  ==============================================================
echo  金钱：%jq% 粮草：%lc% 人马：%rm% 支持人数：%mx%
echo  ==============================================================
echo  秦使就在这里，灾难将是一触即发，该怎么办呢！(键盘选择)
echo.
echo  [1]现在杀了他
echo  [2]好酒好肉招待他
echo  [3]立刻赶他走
echo  [s]在任何章节中均可按s键保存进度！
echo  ==============================================================
echo  萧何的建议：好言相劝，保命要紧！
echo  ==============================================================
choice /c 123s /n 
if %errorlevel%==1 goto S1a
if %errorlevel%==2 goto S1b
if %errorlevel%==3 goto S1c
if %errorlevel%==4 goto savegame

:S1a
cls
echo  ==============================================================
echo   刘邦杀了秦使，兄弟们大快朵颐，但都充满了恐惧……
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   萧何只好拿得此人之令牌，与刘邦瞒天过海，才躲过这场灾难
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   有一些人因此举报刘邦，无奈之下，刘邦杀了他们！
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   支持人数 - 10 以及 金钱 - 50
echo  ==============================================================
pause>nul
set /a jq=jq-50
set /a mx=mx-10
cls
echo  ==============================================================
echo   还好，他度过了危机，等待他的，是下一个挑战……
echo  ==============================================================
pause>nul
goto SC2

:S1b
cls
echo  ==============================================================
echo   尽管他请了秦使大吃大喝，那人也很满意
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   但是萧何仍然非常的不放心
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   于是，在秦使走的时候，萧何派人杀了他……
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   粮草 - 20 以及 支持人数 + 10
echo  ==============================================================
pause>nul
set /a lc=lc-50
set /a mx=mx+10
cls
echo  ==============================================================
echo   他成功度过了这次危机，等待着下一个挑战……
echo  ==============================================================
pause>nul
goto SC2

:S1c
cls
echo  ==============================================================
echo   刘邦放走了秦使
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   秦使回京后禀报了这些情况
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   秦始皇派人血洗中阳里
echo  ==============================================================
pause>nul
goto Gameover

:SC2
cls
ping -n 2 127.1>nul
echo  ==============================================================
echo   不久后，秦始皇抓了大多男丁去服徭役……
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   但是刘邦他们来晚了，他们非常害怕秦律……
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   于是，他们藏到了芒砀山里，正式开始了反秦的征途！
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   眼下就要决战沛县！[粮草 + 1000 , 人马 + 300 , 金钱 + 200]
echo  ==============================================================
pause>nul
set /a jq=jq+200
set /a rm=rm+300
set /a lc=lc+1000
set /a dflc=1500
set /a dfrm=1500
goto S2

:S2
set gk=S2
cls
echo  ==============================================================
echo        第二章 大战沛县(战斗,粮食耗尽或失去所有人马便失败)
echo  ==============================================================
echo  金钱：%jq% 粮草：%lc% 人马：%rm% 支持人数：%mx%
echo  ==============================================================
echo  大战爆发，决战在所难免，而刘邦将要领导将士们拿下沛县！
echo  真的想好每一个回合要怎么打了吗？
echo.
echo  [1]普通进攻     [2]拼死进攻
echo  [3]修生养息     [4]购买粮草\招兵
echo.
echo  对方兵力估计：%dfrm%
echo  对方粮草估计：%dflc%
echo  ==============================================================
echo  萧何的建议：留得青山在，不愁没柴烧！
echo  ==============================================================
choice /c 1234s /n 
if %errorlevel%==1 goto S2a
if %errorlevel%==2 goto S2b
if %errorlevel%==3 goto S2c
if %errorlevel%==4 goto S2d
if %errorlevel%==5 goto savegame

:S2a
set /a wslc=%random% %% 20 * 9
set /a dslc=%random% %% 20 * 11
set /a wsrm=%random% %% 20 * 2
set /a dsrm=%random% %% 20 * 3
set /a rm=rm-wsrm
set /a lc=lc-wslc
set /a dfrm=dfrm-dsrm
set /a dflc=dflc-dslc
cls
echo 本次正常攻城 我方损失 %wsrm% 人马
echo              对方损失 %dsrm% 人马
echo              我方损失 %wslc% 粮草
echo              对方损失 %dslc% 粮草
pause>nul
if %lc% LEQ 0 goto Gameover
if %rm% LEQ 0 goto Gameover
if %dflc% LEQ 0 goto S2win
if %dfrm% LEQ 0 goto S2win
goto S2

:S2b
set /a wslc=%random% %% 40 * 9
set /a dslc=%random% %% 40 * 8
set /a wsrm=%random% %% 40 * 2
set /a dsrm=%random% %% 40 * 3
set /a rm=rm-wsrm
set /a lc=lc-wslc
set /a dfrm=dfrm-dsrm
set /a dflc=dflc-dslc
cls
echo 本次拼死攻城 我方损失 %wsrm% 人马
echo              对方损失 %dsrm% 人马
echo              我方损失 %wslc% 粮草
echo              对方损失 %dslc% 粮草
pause>nul
if %lc% LEQ 0 goto Gameover
if %rm% LEQ 0 goto Gameover
if %dflc% LEQ 0 goto S2win
if %dfrm% LEQ 0 goto S2win
goto S2

:S2c
set /a wslc=%random% %% 15 * 9
set /a dslc=%random% %% 15 * 8
set /a lc=lc+wslc
set /a dflc=dflc+dslc
set /a jgl=%random% %% 3
cls
echo 修生养息了两周~
echo 我方增加 %wslc% 粮草
echo 对方增加 %dslc% 粮草
if %jgl%==0 echo 对方没有偷袭
if %jgl%==2 echo 对方没有偷袭
if %jgl%==1 echo 对方进行了偷袭！损失 65人马！ && set /a rm=rm-65
if %rm% LEQ 0 goto Gameover
pause>nul
goto S2

:S2d
cls
echo 刘邦手下的卢纶来到了村中，他要：
echo [1]招兵买马 (金钱:兵马 = 1:2)
echo [2]购买粮草 (金钱:粮草 = 1:5)
echo [3]回去
choice /c 123 /n 
if %errorlevel%==1 goto S2rm
if %errorlevel%==2 goto S2lc
if %errorlevel%==3 goto S2
:S2rm
echo 请输入要消费的金钱数量(用于招兵)，并按回车继续
set /p input=
set /a jq=jq-input
if %jq% LSS 0 echo 购买失败！金钱不足！按任意键返回战场！ && pause>nul && set /a jq=jq+input && goto S2
set /a rm=rm + input * 2
echo 购买完成！按任意键返回！
pause>nul
goto S2d
:S2lc
echo 请输入要消费的金钱数量(用于买粮草)，并按回车继续
set /p input=
set /a jq=jq-input
if %jq% LSS 0 echo 购买失败！金钱不足！按任意键返回战场！ && pause>nul && set /a jq=jq+input && goto S2
set /a lc=lc + input * 5
echo 购买完成！按任意键返回！
pause>nul
goto S2d

:S2win
cls
ping -n 2 127.1>nul
echo  ==============================================================
echo   在打了很久以后，刘邦终于取得了胜利！[掌声 ，人马 + 500]
echo  ==============================================================
set /a rm=rm+500
pause>nul
cls
echo  ==============================================================
echo   但是毕竟他们的实力不足，所以他决定……
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   投靠项羽！！！！！[支持人数 + 30]
echo  ==============================================================
set /a mx=mx+30
pause>nul
cls
echo  ==============================================================
echo   项羽给他充军2000！ [人马 + 2000 ，粮草 + 2000 ，金钱 + 300]
echo  ==============================================================
set /a jq=jq+300
set /a rm=rm+2000
set /a lc=lc+2000
pause>nul
goto S3

:S3
set gk=S3
cls
echo  ==============================================================
echo                      第三章 智取信任(选择)
echo  ==============================================================
echo  金钱：%jq% 粮草：%lc% 人马：%rm% 支持人数：%mx%
echo  ==============================================================
echo  一场仗打下来，刘邦故意败了，现在要怎么办？
echo.
echo  [1]退回项羽给的兵马
echo  [2]继续去打仗
echo  [3]离开项羽军营
echo  ==============================================================
echo  萧何的建议：得到信任是第一位的，有了实力再分兵自立也不迟！
echo  ==============================================================
choice /c 123s /n 
if %errorlevel%==1 goto S3a
if %errorlevel%==2 goto S3b
if %errorlevel%==3 goto S3c
if %errorlevel%==4 goto savegame


:S3a
cls
echo  ==============================================================
echo   刘邦坚持将项羽给他的兵马退回，并要求亲自带自己的兵
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   他还说这样下去逢战必胜！
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   就这样，项羽对他开始信任了，他没听范增的谏言……
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   兵马 - 2000 ，支持人数 + 5
echo  ==============================================================
set /a rm=rm-2000
set /a mx=mx+5
pause>nul
cls
echo  ==============================================================
echo   项羽决定亲自率兵攻打秦军！
echo  ==============================================================
pause>nul
goto JQ1

:S3b
cls
echo  ==============================================================
echo   刘邦继续带着兵去打仗……
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   的确是打赢了，但是兵权几乎没有了……
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   就这样，项羽一举夺过了他的大部分兵权
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   兵马 = 300 ，支持人数 -10
echo  ==============================================================
set /a rm=300
set /a mx=mx-10
pause>nul
cls
echo  ==============================================================
echo   然后，项羽决定亲自率兵攻打秦军！
echo  ==============================================================
pause>nul
goto JQ1

:S3c
cls
echo  ==============================================================
echo   刘邦离开了项羽的军营……
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   但是他实在没有实力……
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   就这样，战败了
echo  ==============================================================
pause>nul
goto Gameover

:JQ1
cls
mode con: cols=80 lines=20
ping -n 2 127.1>nul
echo    ************                                *************************
echo    *          *                                *                       *
echo    * 项羽军营 * ——————————————→ *        秦军军营       *
echo    *          *                                *                       *
echo    ************                                *************************
ping -n 2 127.1>nul
cls
echo    ************                                *************************
echo    *          *                                *                       *
echo    * 项羽军营 * ——————————————→ *        秦军军营       *
echo    *          *     项羽：与他们决一死战！     *                       *
echo    ************                                *************************
ping -n 2 127.1>nul
cls
echo    ************                                *************************
echo    *          *                                *                       *
echo    * 项羽军营 * ——————————————→ *        秦军军营       *
echo    *          *     将士们：杀啊！！！！！     *                       *
echo    ************                                *************************
ping -n 2 127.1>nul
cls
echo    ************                                *************************
echo    *          *                                *                       *
echo    * 项羽军营 * ————————————————→         秦军军营    *
echo    *          *     将士们：杀啊！！！！！     *                       *
echo    ************                                *************************
ping -n 2 127.1>nul
cls
echo    ************                                *************************
echo    *          *                                *                       *
echo    * 项羽军营 * ——————————————————→      秦军军营   *
echo    *          *     将士们：杀啊！！！！！     *                       *
echo    ************                                *************************
ping -n 2 127.1>nul
cls
echo    ************                                *************************
echo    *          *                                *                       *
echo    * 项羽军营 * ——————————————————————→ 秦军军营*
echo    *          *     将士们：杀啊！！！！！     *                       *
echo    ************                                *************************
ping -n 2 127.1>nul
cls
echo    ************                                *************************
echo    *          *                                *                       *
echo    * 项羽军营 * —————————————————————————→ 秦军
echo    *          *     将士们：杀啊！！！！！     *                       *
echo    ************                                *************************
ping -n 2 127.1>nul
cls
echo    ************                                *************************
echo    *          *                                *                       *
echo    * 项羽军营 * ————————————————————————————→ 
echo    *          *     就这样，项羽以少胜多……   *                       *
echo    ************                                *************************
ping -n 2 127.1>nul
mode con: cols=64 lines=20
cls
ping -n 2 127.1>nul
echo  ==============================================================
echo   项羽成功的以少胜多攻下了秦城
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   但是在后来的战斗中，项羽和项伯都没有没有听从韩信的建议
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   所以，在与秦将章邯的战斗中，项伯战败人亡
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   刘邦来到了定陶城外，却被手下打晕
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   项羽知道了刘邦的好心，于是与他结为兄弟…… [支持人数 + 30]
echo  ==============================================================
set /a mx=mx+30
pause>nul
goto S4

:S4
set gk=S4
cls
echo  ==============================================================
echo                      第四章 怀王之约(选择)
echo  ==============================================================
echo  金钱：%jq% 粮草：%lc% 人马：%rm% 支持人数：%mx%
echo  ==============================================================
echo  怀王为了牵制项羽的权利，决定要分兵两路
echo.
echo  [1]向怀王提建议
echo  [2]用别人间接的提建议
echo  [3]继续鬼混
echo  ==============================================================
echo  本次没有谋士贡献建议
echo  ==============================================================
choice /c 123s /n 
if %errorlevel%==1 goto S4a
if %errorlevel%==2 goto S4b
if %errorlevel%==3 goto S4c
if %errorlevel%==4 goto savegame


:S4a
if %mx% GEQ 75 goto cg1
cls
ping -n 2 127.1>nul
echo  ==============================================================
echo   刘邦的确去找了怀王
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   但是因为支持人数太少直接提建议失败
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   只好重新在找人间接第去提建议
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   结果 粮草 - 500 ，金钱 - 300 这才成功
echo  ==============================================================
set /a lc=lc-500
set /a jq=jq-300
pause>nul
goto cg1

:S4b
cls
ping -n 2 127.1>nul
echo  ==============================================================
echo   刘邦去找人间接提建议
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   几番周折后终于成功了
echo  ==============================================================
pause>nul
goto cg1

:S4c
cls
ping -n 2 127.1>nul
echo  ==============================================================
echo   刘邦鬼混失去了很多支持与金钱 [金钱 - 100 ，支持人数 - 30]
echo  ==============================================================
set /a jq=jq-100
set /a mx=mx-30
pause>nul
cls
echo  ==============================================================
echo   但在萧何的劝说下，还是走上了正轨，提了建议……
echo  ==============================================================
pause>nul
goto cg1

:cg1
cls
ping -n 2 127.1>nul
echo  ==============================================================
echo   建议成功了，于是怀王说了一句惊天动地的话——
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   先入关中者为王！
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  * - - * 萧何：主公，我们必须今夜拔营，前往关中！
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  * ！！* 刘邦：好！通知弟兄们，拔营！！！！！！
echo  *  -  *
echo  ==============================================================
pause>nul
goto JQ2

:JQ2
cls
ping -n 2 127.1>nul
echo.
echo                      ○ 咸阳
echo                     {
echo                      \
echo                       \
echo                        \
echo                         -------
echo                                }
echo                               /
echo                               \
echo                                ☆ 函谷关
echo                                 \
echo                                  ——
echo                                      \
echo                                      ○ 项羽军营
echo  萧何：这注定这是一场恶战！
pause>nul
echo.
echo  刘邦：这一战必须要打！
echo  咱们还有之前俘虏的那些人呢！[人马 + 800 ，粮草 + 300]
pause>nul
set /a jq=jq+50
set /a rm=rm+800
set /a lc=lc+300
set /a dflc=2800
set /a dfrm=2400
set /a rc=0
goto S5

:S5
set gk=S5
cls
echo  ==============================================================
echo                     第五章 幽灵函谷关(战斗)
echo  ==============================================================
echo  金钱：%jq% 粮草：%lc% 人马：%rm% 支持人数：%mx% 人才：%rc%
echo  ==============================================================
echo  如果不能突破函谷关，就很难先到关中
echo  每一个决定都至关重要，当然，与秦军拼了！
echo.
echo  [1]普通进攻     [2]拼死进攻
echo  [3]修生养息     [4]购买粮草\招兵
echo  [5]购买人才(能够减少损失)
echo.
echo  对方兵力估计：%dfrm%
echo  对方粮草估计：%dflc%
echo  ==============================================================
echo  萧何的建议：一定要智取，不能蛮打！
echo  ==============================================================
choice /c 12345s /n 
if %errorlevel%==1 goto S5a
if %errorlevel%==2 goto S5b
if %errorlevel%==3 goto S5c
if %errorlevel%==4 goto S5d
if %errorlevel%==5 goto S5e
if %errorlevel%==6 goto savegame


:S5a
set /a wslc=%random% %% 40 * 9 * (100-rc*10) / 100
set /a dslc=%random% %% 45 * 8
set /a wsrm=%random% %% 40 * 3 * (100-rc*10) / 100
set /a dsrm=%random% %% 40 * 3
set /a rm=rm-wsrm
set /a lc=lc-wslc
set /a dfrm=dfrm-dsrm
set /a dflc=dflc-dslc
cls
echo 本次正常攻城 我方损失 %wsrm% 人马
echo              对方损失 %dsrm% 人马
echo              我方损失 %wslc% 粮草
echo              对方损失 %dslc% 粮草
pause>nul
if %lc% LEQ 0 goto Gameover
if %rm% LEQ 0 goto Gameover
if %dflc% LEQ 0 goto S5win
if %dfrm% LEQ 0 goto S5win
goto S5

:S5b
set /a wslc=%random% %% 60 * 9 * (100-rc*10) / 100
set /a dslc=%random% %% 60 * 8
set /a wsrm=%random% %% 60 * 2 * (100-rc*10) / 100
set /a dsrm=%random% %% 60 * 3
set /a rm=rm-wsrm
set /a lc=lc-wslc
set /a dfrm=dfrm-dsrm
set /a dflc=dflc-dslc
cls
echo 本次拼死攻城 我方损失 %wsrm% 人马
echo              对方损失 %dsrm% 人马
echo              我方损失 %wslc% 粮草
echo              对方损失 %dslc% 粮草
pause>nul
if %lc% LEQ 0 goto Gameover
if %rm% LEQ 0 goto Gameover
if %dflc% LEQ 0 goto S5win
if %dfrm% LEQ 0 goto S5win
goto S5

:S5c
set /a wslc=%random% %% 30 * 14
set /a dslc=%random% %% 30 * 8
set /a lc=lc+wslc
set /a dflc=dflc+dslc
set /a jgl=%random% %% 4
cls
echo 修生养息了两周~
echo 我方增加 %wslc% 粮草
echo 对方增加 %dslc% 粮草
if %jgl%==0 echo 对方没有偷袭
if %jgl%==2 echo 对方没有偷袭
if %jgl%==3 echo 对方没有偷袭
if %jgl%==1 echo 对方进行了偷袭！损失120人马！ && set /a rm=rm-120
if %rm% LEQ 0 goto Gameover
pause>nul
goto S5

:S5d
cls
echo 刘邦手下的卢纶来到了村中，他要：
echo [1]招兵买马 (金钱:兵马 = 1:3)
echo [2]购买粮草 (金钱:粮草 = 1:4)
echo [3]回去
choice /c 123 /n 
if %errorlevel%==1 goto S5rm
if %errorlevel%==2 goto S5lc
if %errorlevel%==3 goto S5
:S5rm
echo 请输入要消费的金钱数量(用于招兵)，并按回车继续
set /p input=
set /a jq=jq-input
if %jq% LSS 0 echo 购买失败！金钱不足！按任意键返回战场！ && pause>nul && set /a jq=jq+input && goto S5
set /a rm=rm + input * 3
echo 购买完成！按任意键返回！
pause>nul
goto S5d
:S5lc
echo 请输入要消费的金钱数量(用于买粮草)，并按回车继续
set /p input=
set /a jq=jq-input
if %jq% LSS 0 echo 购买失败！金钱不足！按任意键返回战场！ && pause>nul && set /a jq=jq+input && goto S5
set /a lc=lc + input * 4
echo 购买完成！按任意键返回！
pause>nul
goto S5d

:S5e
cls
echo 请输入要购买的人才数量(每个能减少1/10的损伤，每个80金钱)
set /p input=
set /a jq=jq-input * 80
if %jq% LSS 0 echo 购买失败！金钱不足！按任意键返回战场！ && pause>nul && set /a jq=jq+input * 80 && goto S5
set /a rc=rc + input
echo 购买完成！按任意键返回！
pause>nul
goto S5

:S5win
cls
ping -n 2 127.1>nul
echo  ==============================================================
echo   终于，刘邦他们攻克了函谷关…… [人马 + 500 ，支持人数 + 100]
echo  ==============================================================
set /a rm=rm+500
set /a mx=mx+100
pause>nul
cls
echo  ==============================================================
echo   在又打了无数小仗后，刘邦成功进了关中，并下令驻守外围
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   而此时，项羽更是气急败坏！
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo   刘邦决定退守灞上，但他没想到的是——
echo  ==============================================================
pause>nul
goto JQ3

:JQ3
cls
echo  ==============================================================
echo  *******
echo  * ！！* 项羽：什么！刘邦这个黄口小儿，我要灭了他！
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  * - - * 范增：我早就说过你会越来越看清他的真面目的……
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  * ！！* 项羽：好！通知全军，明天我要血洗灞上！！！！！
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo                  但是项伯来到了汉营找张良……
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  * ！！* 张良：什么！项羽要血洗灞上！
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  *○ ○* 项伯：张良兄啊，你还是快走吧！
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  * ！！* 张良：我就是不明白他凭什么啊！
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  *○ ○* 项伯：还不是因为刘邦下令据守嘛！
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  * ！！* 张良：诶呀！那是我下的令啊！我是为了……
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo         总而言之，张良成功的让项伯去说服项羽，也成功了……
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  * - - * 项羽：我决定明天不打了，先让刘邦过几天……
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  * ！！* 范增：大王，这万万不可啊！刘邦一日不除，就一日危矣！
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  * - - * 项羽：那你说怎么办？！
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  * ！！* 范增：大王，这样子……
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo                   就这样，著名的鸿门宴诞生了……
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  * - - * 刘邦：你们认为我该不该去？
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  * ！！* 众人：不不不！不能去！项羽要杀你！
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  * - - * 刘邦：可是，就算不去，他就不杀我了吗？
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  * ！！* 众人：这……
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  * - - * 刘邦：所以说，我必须去！
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo  *******
echo  * ！！* 众人：我们会保护好你的，主公！
echo  *  -  *
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo              刘邦在发现险情且项伯搭救后，准备逃跑
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo              没料想，却被当年的手下败将雍齿拦住……
echo  ==============================================================
pause>nul
goto S6

:S6
set gk=S6
cls
echo  ==============================================================
echo                      第六章 逃亡鸿门(选择)
echo  ==============================================================
echo  雍齿：想走吗？给我跪下求饶！
echo.
echo  [1]对他说：不可能
echo  [2]跪下求饶
echo  ==============================================================
echo  本次不可能有任何谋士的建议~
echo  ==============================================================
choice /c 12s /n 
if %errorlevel%==1 goto S6a
if %errorlevel%==2 goto S6b
if %errorlevel%==3 goto savegame


:S6a
cls
echo  ==============================================================
echo                  于是雍齿把刘邦交给了项羽……
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo                         然后刘邦挂了……
echo  ==============================================================
pause>nul
goto Gameover

:S6b
cls
echo  ==============================================================
echo                      于是雍齿放走了刘邦……
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo                刘邦回到了灞上，静静地等待时机……
echo  ==============================================================
pause>nul
goto JQ3

:JQ3
cls
ping -n 2 127.1>nul
echo.
echo   终于在有一天，项羽自称西楚霸王并分封了各诸侯土地，
ping -n 1 127.1>nul
echo   为了响应范增的计策，将刘邦分封与汉地，名汉王。
ping -n 1 127.1>nul
echo   项羽认为汉地必是荒凉之地，想借机解决刘邦，
ping -n 1 127.1>nul
echo   但是这一次他错了，刘邦义无反顾的去了汉地
ping -n 1 127.1>nul
echo   而且他这一次回来——有了十几万兵马和大将【韩信】
ping -n 1 127.1>nul
pause>nul
cls
echo  ==============================================================
echo             终于，刘邦找到了一个全面抗击项羽的机会
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo               项羽弑杀了义帝，也就是所谓的楚王
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo        所以他召集了诸侯，准备进攻彭城……{总人马 + 580000}
echo  ==============================================================
pause>nul
set /a dfrm=8000
set /a dflc=8000
set /a rm=rm+580000
set /a lc=rm+40000
set /a mx=mx+400
set /a jq=jq+1000
set /a rc=0
goto S7

:S7
set gk=S7
cls
echo  ==============================================================
echo                       第七章 奋战彭城(战斗)
echo  ==============================================================
echo  金钱：%jq% 粮草：%lc% 人马：%rm% 支持人数：%mx% 人才：%rc%
echo  ==============================================================
echo  彭城易攻难守，但是城中有项羽军师范增镇守
echo  尽管如此，这场仗没有理由不赢！
echo.
echo  [1]普通进攻     [2]拼死进攻
echo  [3]修生养息     [4]购买人才
echo.
echo  对方兵力估计：%dfrm%
echo  对方粮草估计：%dflc%
echo  ==============================================================
echo  萧何的建议：彭城一举拿下！就是拿下项羽的心脏！
echo  ==============================================================
choice /c 1234s /n 
if %errorlevel%==1 goto S7a
if %errorlevel%==2 goto S7b
if %errorlevel%==3 goto S7c
if %errorlevel%==4 goto S7e
if %errorlevel%==5 goto savegame


:S7a
set /a wslc=%random% %% 400 * 9 * (100-rc*5) / 100
set /a dslc=%random% %% 20 * 8
set /a wsrm=%random% %% 1800 * 3 * (100-rc*5) / 100
set /a dsrm=%random% %% 40 * 3
set /a rm=rm-wsrm
set /a lc=lc-wslc
set /a dfrm=dfrm-dsrm
set /a dflc=dflc-dslc
cls
echo 本次正常攻城 我方损失 %wsrm% 人马
echo              对方损失 %dsrm% 人马
echo              我方损失 %wslc% 粮草
echo              对方损失 %dslc% 粮草
pause>nul
if %lc% LEQ 0 goto Gameover
if %rm% LEQ 0 goto Gameover
if %dflc% LEQ 5000 goto S7win
if %dfrm% LEQ 5000 goto S7win
goto S7

:S7b
set /a wslc=%random% %% 600 * 9 * (100-rc*5) / 100
set /a dslc=%random% %% 30 * 8
set /a wsrm=%random% %% 4000 * 2 * (100-rc*5) / 100
set /a dsrm=%random% %% 60 * 3
set /a rm=rm-wsrm
set /a lc=lc-wslc
set /a dfrm=dfrm-dsrm
set /a dflc=dflc-dslc
cls
echo 本次拼死攻城 我方损失 %wsrm% 人马
echo              对方损失 %dsrm% 人马
echo              我方损失 %wslc% 粮草
echo              对方损失 %dslc% 粮草
pause>nul
if %lc% LEQ 0 goto Gameover
if %rm% LEQ 0 goto Gameover
if %dflc% LEQ 5000 goto S7win
if %dfrm% LEQ 5000 goto S7win
goto S7

:S7c
set /a wslc=%random% %% 3000 * 14
set /a dslc=%random% %% 1000 * 20
set /a lc=lc+wslc
set /a dflc=dflc+dslc
set /a jgl=%random% %% 4
cls
echo 修生养息了两周~
echo 我方增加 %wslc% 粮草
echo 对方增加 %dslc% 粮草
if %jgl%==0 echo 对方没有偷袭
if %jgl%==2 echo 对方没有偷袭
if %jgl%==3 echo 对方没有偷袭
if %jgl%==1 echo 对方进行了偷袭！损失4000人马！ && set /a rm=rm-4000
if %rm% LEQ 0 goto Gameover
pause>nul
goto S7

:S7e
cls
echo 请输入要购买的人才数量(每个能减少1/20的损伤，每个150金钱)
set /p input=
set /a jq=jq-input * 150
if %jq% LSS 0 echo 购买失败！金钱不足！按任意键返回战场！ && pause>nul && set /a jq=jq+input * 150 && goto S7
set /a rc=rc + input
echo 购买完成！按任意键返回！
pause>nul
goto S7

:S7win
cls
ping -n 2 127.1>nul
cls
echo  ==============================================================
echo              范增眼看形式不妙，立刻弃了城，撤了军
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo           刘邦随即进城，饮酒作乐……以致韩信出城驻守
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo          正在解决田荣之乱的项羽闻讯后，决定杀回彭城
echo  ==============================================================
pause>nul
goto JQ4

:JQ4
cls
mode con: cols=80 lines=20
ping -n 2 127.1>nul
echo    *************************
echo    *                       *
echo    *     彭城(诸侯军营)    *                          ←—————— 项羽人马
echo    *                       *
echo    *************************
ping -n 2 127.1>nul
cls
echo    *************************
echo    *                       *
echo    *     彭城(诸侯军营)    *                     ←—————— 项羽人马
echo    *                       *
echo    *************************
ping -n 2 127.1>nul
cls
echo    *************************
echo    *                       *
echo    *     彭城(诸侯军营)    *                ←—————— 项羽人马
echo    *                       *
echo    *************************
ping -n 2 127.1>nul
cls
echo    *************************
echo    *                       *
echo    *     彭城(诸侯军营)    *         ←—————— 项羽人马
echo    *                       *
echo    *************************
ping -n 2 127.1>nul
cls
echo    *************************
echo    *                       *
echo    *     彭城(诸侯军营)    *    ←—————— 项羽人马
echo    *                       *
echo    *************************
ping -n 2 127.1>nul
cls
echo    *************************
echo    *                      ]*
echo    *     彭城(诸侯军营)   ]×←—————— 项羽人马
echo    *                      ]*
echo    *************************
echo.
echo.
echo.
echo.             
echo.              
echo.              
echo.                  
echo              ↑
echo              **  范增军队
echo              **
ping -n 2 127.1>nul
cls
echo    *************************
echo    *                      ]*
echo    *     彭城(诸侯军营)   ]×←—————— 项羽人马
echo    *                      ]*
echo    *************************
echo.
echo.
echo.
echo.             
echo.
echo              ↑
echo              **    范增军队
echo              **
echo              **
echo              **
ping -n 2 127.1>nul
cls
echo    *************************
echo    *                      ]*
echo    *     彭城(诸侯军营)   ]×←—————— 项羽人马
echo    *                      ]*
echo    *************************
echo.
echo.
echo.
echo              ↑
echo              **
echo              **
echo              **    范增军队
echo              **
echo              **
echo              **
ping -n 2 127.1>nul
cls
echo    *************************
echo    *                      ]*
echo    *     彭城(诸侯军营)   ]×←—————— 项羽人马
echo    *                      ]*
echo    *************************
echo.
echo.
echo              ↑
echo              **
echo              **
echo              **    范增军队
echo              **
echo              **
echo              **
ping -n 2 127.1>nul
cls
echo    *************************
echo    *                      ]*
echo    *     彭城(诸侯军营)   ]×←—————— 项羽人马
echo    *                      ]*
echo    *************************
echo.
echo              ↑
echo              **
echo              **
echo              **    范增军队
echo              **
echo              **
echo              **
ping -n 2 127.1>nul
cls
echo    *************************
echo    *                      ]*
echo    *     彭城(诸侯军营)   ]×←—————— 项羽人马
echo    *                      ]*
echo    *********××************
echo.             ↑
echo              **
echo              **
echo              **    范增军队
echo              **
echo              **
echo              **
ping -n 2 127.1>nul
cls
echo    *************************
echo    *                      ]*
echo    * 彭城(溃散)         ←—————— 项羽人马
echo    *                      ]*
echo    **********↑*************
echo.             ↑
echo              **
echo              **
echo              **    范增军队
echo              **
echo              **
echo              **
ping -n 2 127.1>nul
cls
echo    *************************
echo    *                      *
echo  ←刘邦逃窜  ↑   ←—————— 项羽人马
echo    *         ↑            *
echo    **********↑*************
echo.             ↑
echo              **
echo              **
echo              **    范增军队
echo              **
echo              **
echo              **
ping -n 2 127.1>nul
mode con: cols=64 lines=20
cls
echo  ==============================================================
echo                   刘邦兵败彭城后逃窜至沛县……
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo              后重整旗鼓，返回荥阳都城，准备迎战项羽
echo  ==============================================================
pause>nul
cls
echo.
echo  终于，项羽来攻打了荥阳
echo  但是刘邦拒绝出战，项羽拿他没有办法
echo  荥阳粮食充足，而项羽缺少粮食
echo.
echo  范增希望项羽尽快攻下荥阳，而项羽却不听范增之言
echo  在范增的有生之年都没能劝住项羽
echo.
echo  项羽决定起兵荥阳，与刘邦决一死战！
set /a dfrm=35000
set /a dflc=6000
set /a rm=10000
set /a lc=30000
set /a rc=0
goto S8

:S8
set gk=S8
cls
echo  ==============================================================
echo                     第八章 疯狂的项羽(战斗)
echo  ==============================================================
echo  金钱：%jq% 粮草：%lc% 人马：%rm% 支持人数：%mx% 人才：%rc%
echo  ==============================================================
echo  彭城易攻难守，但是城中有项羽军师范增镇守
echo  尽管如此，这场仗没有理由不赢！
echo.
echo  [1]继续守城     [2]出城迎战
echo  [3]弃城逃跑     [4]购买人才
echo.
echo  对方兵力估计：%dfrm%
echo  对方粮草估计：%dflc%
echo  ==============================================================
echo  老头建议：弃城逃跑 ，张良建议：死守荥阳
echo  ==============================================================
choice /c 1234s /n 
if %errorlevel%==1 goto S8a
if %errorlevel%==2 goto S8b
if %errorlevel%==3 goto S8c
if %errorlevel%==4 goto S8e
if %errorlevel%==5 goto savegame


:S8a
set /a wslc=%random% %% 400 * 9 * (100-rc*5) / 100
set /a dslc=%random% %% 20 * 8
set /a wsrm=%random% %% 1000 * 3 * (100-rc*5) / 100
set /a dsrm=%random% %% 40 * 3
set /a rm=rm-wsrm
set /a lc=lc-wslc
set /a dfrm=dfrm-dsrm
set /a dflc=dflc-dslc
cls
echo 本次正常守城 我方损失 %wsrm% 人马
echo              对方损失 %dsrm% 人马
echo              我方损失 %wslc% 粮草
echo              对方损失 %dslc% 粮草
pause>nul
if %lc% LEQ 0 goto Gameover
if %rm% LEQ 0 goto Gameover
goto S7

:S8b
set /a wslc=%random% %% 600 * 9 * (100-rc*5) / 100
set /a dslc=%random% %% 30 * 8
set /a wsrm=%random% %% 3000 * 2 * (100-rc*5) / 100
set /a dsrm=%random% %% 60 * 3
set /a rm=rm-wsrm
set /a lc=lc-wslc
set /a dfrm=dfrm-dsrm
set /a dflc=dflc-dslc
cls
echo 本次出城迎战 我方损失 %wsrm% 人马
echo              对方损失 %dsrm% 人马
echo              我方损失 %wslc% 粮草
echo              对方损失 %dslc% 粮草
pause>nul
if %lc% LEQ 0 goto Gameover
if %rm% LEQ 0 goto Gameover
goto S8

:S8c
cls
echo  ==============================================================
echo              刘邦终于决定弃城，于是，他开始往后跑
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo              但是项羽穷追不舍，刘邦眼看就要败了……
echo  ==============================================================
pause>nul
goto S9

:S8e
cls
echo 请输入要购买的人才数量(每个能减少1/20的损伤，每个150金钱)
set /p input=
set /a jq=jq-input * 150
if %jq% LSS 0 echo 购买失败！金钱不足！按任意键返回战场！ && pause>nul && set /a jq=jq+input * 150 && goto S8
set /a rc=rc + input
echo 购买完成！按任意键返回！
pause>nul
goto S8

:S9
set gk=S9
cls
echo  ==============================================================
echo                      第六章 天下抉择(选择)
echo  ==============================================================
echo  刘邦已经快要败了，怎么办！
echo.
echo  [1]试图与项羽求和
echo  [2]拼死到底
echo  [3]继续一路撤
echo  [s]本章节强烈建议保存进度！
echo  ==============================================================
echo  张良：保命要紧，留得青山在不愁没柴烧！
echo  ==============================================================
choice /c 123s /n 
if %errorlevel%==1 goto S9a
if %errorlevel%==2 goto S9b
if %errorlevel%==3 goto S9b
if %errorlevel%==4 goto savegame

:S9a
cls
echo  ==============================================================
echo               没想到的是，项羽竟然同意了平分天下！
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo                      但是这一切都没有完……
echo  ==============================================================
pause>nul
goto JQ5

:S9b
cls
echo  ==============================================================
echo            总而言之，言而总之，刘邦在战斗与逃亡中挂了
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo                       项羽取得了最后的胜利！
echo  ==============================================================
pause>nul
goto Gameover

:JQ5
cls
echo  ==============================================================
echo            刘邦突然觉得，自己现在应该就去突袭项羽！
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo            如果现在不去，以后就又该是项羽来打他了！
echo  ==============================================================
pause>nul
cls
ping -n 2 127.1>nul
echo  ==============================================================
echo             刘邦偷袭失败后退致垓下，与项羽开始了对峙
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo           卢纶假装叛变，让项羽没有对韩信的防备便直插而来
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo           当项羽兵临城下时，刘邦拒不出城，项羽气急败坏
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo           项羽突然发现从北面和南面来了韩信与彭越的大军！
echo  ==============================================================
pause>nul
cls
echo  ==============================================================
echo           项羽大喊：项羽将在垓下，3万对阵60万取胜！！！！
echo  ==============================================================
pause>nul
cls
ping -n 2 127.1>nul
echo.
echo   大风吹
ping -n 2 127.1>nul
echo   吹四方
ping -n 2 127.1>nul
echo   我孤独在中央
ping -n 2 127.1>nul
echo.
echo   那令人激动的最后的决战就要到了！！
ping -n 2 127.1>nul
echo   箭穿透铠甲，穿不透时光！！！！！！！
ping -n 2 127.1>nul
echo   杀啊！！！！！！！！！！！！！！！！！
ping -n 2 127.1>nul
echo   大风吹！云飞扬！！！！！！！！！！！！！
ping -n 2 127.1>nul
echo   谁知我心所向！！！！！！！！！！！！！！！
ping -n 2 127.1>nul
set /a jq=jq+3000
set /a lc=lc+105000
set /a rm=rm+500000
set /a mx=mx+3200
set /a rc=0
set /a dj=4
set /a dflc=9000
set /a dfrm=30000
goto S10

:S10
set gk=S10
cls
echo  ==============================================================
echo                      第十章 决战垓下(战斗)
echo  ==============================================================
echo  金钱：%jq% 粮草：%lc% 人马：%rm% 支持人数：%mx% 人才：%rc%
echo  ==============================================================
echo  韩信和彭越的大军加入了
echo  难道这场仗还有理由不赢吗？(项羽军队的战斗力极强)
echo.
echo  [1]普通进攻     [2]拼死猛攻
echo  [3]包围战术     [4]购买人才
echo  [5]猛攻撤退     [6]乘胜追击
echo.
echo  对方兵力估计：%dfrm%  对方大将：%dj%(使用包围战术可能消灭大将)
echo  对方粮草估计：%dflc%
echo  ==============================================================
echo  大家一起建议：决战了，赢了他！
echo  ==============================================================
choice /c 123456s /n 
if %errorlevel%==1 goto S10a
if %errorlevel%==2 goto S10b
if %errorlevel%==3 goto S10c
if %errorlevel%==4 goto S10e
if %errorlevel%==5 goto S10f
if %errorlevel%==6 goto S10g
if %errorlevel%==7 goto savegame

:S10g
set /a jgl=%random% %% 3
cls
if %jgl%==2 (echo 成功乘胜追击！一举重击项羽！ && set /a dfrm=dfrm-%random% / 14 && set /a dflc=dflc - %random% / 50) else (echo 没攻击成反被反攻！损失许多！ && set /a rm=rm-%random%)
pause>nul
if %lc% LEQ 0 goto Gameover
if %rm% LEQ 0 goto Gameover
if %dfrm% LEQ 0 goto Winer
if %dflc% LEQ -3000 goto Winer
goto S10

:S10f
set /a wslc=%random% %% 400 * 9 * (100-rc*5) / 100
set /a dslc=%random% %% 130 * 8
set /a wsrm=%random% %% 6000 * 3 * (100-rc*5) / 100
set /a dsrm=%random% %% 300 * 3 - dj * 50
set /a rm=rm-wsrm
set /a lc=lc-wslc
set /a dfrm=dfrm-dsrm
set /a dflc=dflc-dslc
cls
echo 本次猛攻撤退 我方损失 %wsrm% 人马
echo              对方损失 %dsrm% 人马
echo              我方损失 %wslc% 粮草
echo              对方损失 %dslc% 粮草
pause>nul
if %lc% LEQ 0 goto Gameover
if %rm% LEQ 0 goto Gameover
if %dfrm% LEQ 0 goto Winer
if %dflc% LEQ -3000 goto Winer
goto S10

:S10a
set /a wslc=%random% %% 700 * 9 * (100-rc*5) / 100
set /a dslc=%random% %% 20 * 8
set /a wsrm=%random% %% 3000 * 3 * (100-rc*5) / 100
set /a dsrm=%random% %% 150 * 3 - dj * 50
set /a rm=rm-wsrm
set /a lc=lc-wslc
set /a dfrm=dfrm-dsrm
set /a dflc=dflc-dslc
cls
echo 本次正常进攻 我方损失 %wsrm% 人马
echo              对方损失 %dsrm% 人马
echo              我方损失 %wslc% 粮草
echo              对方损失 %dslc% 粮草
pause>nul
if %lc% LEQ 0 goto Gameover
if %rm% LEQ 0 goto Gameover
if %dfrm% LEQ 0 goto Winer
if %dflc% LEQ -3000 goto Winer
goto S10

:S10b
set /a wslc=%random% %% 1400 * 9 * (100-rc*5) / 100
set /a dslc=%random% %% 50 * 8
set /a wsrm=%random% %% 5000 * 2 * (100-rc*5) / 100
set /a dsrm=%random% %% 400 * 3 - dj * 50
set /a rm=rm-wsrm
set /a lc=lc-wslc
set /a dfrm=dfrm-dsrm
set /a dflc=dflc-dslc
cls
echo 本次拼死猛攻 我方损失 %wsrm% 人马
echo              对方损失 %dsrm% 人马
echo              我方损失 %wslc% 粮草
echo              对方损失 %dslc% 粮草
pause>nul
if %lc% LEQ 0 goto Gameover
if %rm% LEQ 0 goto Gameover
if %dfrm% LEQ 0 goto Winer
if %dflc% LEQ -3000 goto Winer
goto S10

:S10c
set /a rm=rm-10000
set /a lc=lc-6000
set /a dfrm=dfrm-700
set /a dflc=dflc-150
set /a jgl=%random% %% 3
cls
echo 本次包围战术 我方损失 10000 人马
echo              对方损失 700 人马
echo              我方损失 6000 粮草
echo              对方损失 150 粮草
if %dj%==0 pause>nul && goto S10
if %jgl%==2 (echo 成功斩杀对方大将 1 人 && set /a dj=dj-1) else (echo 没有斩杀对方大将！)
pause>nul
if %lc% LEQ 0 goto Gameover
if %rm% LEQ 0 goto Gameover
if %dfrm% LEQ 0 goto Winer
if %dflc% LEQ -3000 goto Winer
goto S10

:S10e
cls
echo 请输入要购买的人才数量(每个能减少1/20的损伤，每个400金钱)
set /p input=
set /a jq=jq-input * 400
if %jq% LSS 0 echo 购买失败！金钱不足！按任意键返回战场！ && pause>nul && set /a jq=jq+input * 400 && goto S10
set /a rc=rc + input
echo 购买完成！按任意键返回！
pause>nul
goto S10

:Winer
cls
echo.
echo   项羽杀出了重围
ping -n 2 127.1>nul
echo   来到了江东
ping -n 2 127.1>nul
echo.
echo   但他誓死不过江东，说自己无颜见江东父老
ping -n 2 127.1>nul
echo   于是在自己的老乡吕马童面前自刎……
ping -n 2 127.1>nul
echo.
echo   而刘邦经过多年征战，终于取得了天下……
ping -n 2 127.1>nul
echo   以后，为了防止权力旁落，先后杀了韩信等忠良
ping -n 2 127.1>nul
echo   逼得卢纶英布等人造反……
ping -n 2 127.1>nul
echo.
echo   最后，一切的动乱都被平息了……
ping -n 2 127.1>nul
set chcq=楚汉传奇
echo.  这就是这伟大的 —— %chcq%
ping -n 2 127.1>nul
echo.  
echo   全剧终（按任意键统计结果）
pause>nul
cls
echo.
echo   你的成绩：
echo.
echo   最终金钱：%jq%
echo   最终人马：%rm%
echo   最终支持：%mx%
echo   最终人才：%rc%
echo   最终粮草：%lc%
echo.
echo   你拥有了刘邦的智慧~但你能否有通过下一部作品的智慧？
echo   请期待Bat吧的好作品！
echo.
echo   广告：囧地冒险系列\埃德加的行动 都是很不错的作品！推荐下载！
echo         Cyxgg.ys168.com 好东西，都在这里找！
echo.
echo   按任意键结束游戏！
pause>nul
exit